RIOT-OS/RIOT/cpu/cc26x0_cc13x0/vendor/inc/hw_ssi.h
// Field:     [2] MS
//
// Master or slave mode select. This bit can be modified only when SSI is
// disabled, SSE=0.
// ENUMs:
// SLAVE                    Device configured as slave
// MASTER                   Device configured as master
#define SSI_CR1_MS                                                  0x00000004
#define SSI_CR1_MS_BITN                                                      2
#define SSI_CR1_MS_M                                                0x00000004
#define SSI_CR1_MS_S                                                         2
#define SSI_CR1_MS_SLAVE                                            0x00000004
#define SSI_CR1_MS_MASTER                                           0x00000000

// Field:     [1] SSE
//
// Synchronous serial interface enable.
// ENUMs:
// SSI_ENABLED              Operation enabled
// SSI_DISABLED             Operation disabled
#define SSI_CR1_SSE                                                 0x00000002
#define SSI_CR1_SSE_BITN                                                     1
#define SSI_CR1_SSE_M                                               0x00000002
#define SSI_CR1_SSE_S                                                        1
#define SSI_CR1_SSE_SSI_ENABLED                                     0x00000002
#define SSI_CR1_SSE_SSI_DISABLED                                    0x00000000

// Field:     [0] LBM
//
// Loop back mode:
//
// 0: Normal serial port operation enabled.
// 1: Output of transmit serial shifter is connected to input of receive serial
// shifter internally.
#define SSI_CR1_LBM                                                 0x00000001
#define SSI_CR1_LBM_BITN                                                     0
#define SSI_CR1_LBM_M                                               0x00000001
#define SSI_CR1_LBM_S                                                        0

//*****************************************************************************
//
// Register: SSI_O_DR
//
//*****************************************************************************
// Field:  [15:0] DATA
//
// Transmit/receive data
// The values read from this field or written to this field must be
// right-justified when SSI is programmed for a data size that is less than 16
// bits (CR0.DSS != 0b1111). Unused bits at the top are ignored by transmit
// logic. The receive logic automatically right-justifies.
#define SSI_DR_DATA_W                                                       16
#define SSI_DR_DATA_M                                               0x0000FFFF
#define SSI_DR_DATA_S                                                        0

//*****************************************************************************
//
// Register: SSI_O_SR
//
//*****************************************************************************
// Field:     [4] BSY
//
// Serial interface busy:
//
// 0: SSI is idle
// 1: SSI is currently transmitting and/or receiving a frame or the transmit
// FIFO is not empty.
#define SSI_SR_BSY                                                  0x00000010
#define SSI_SR_BSY_BITN                                                      4
#define SSI_SR_BSY_M                                                0x00000010
#define SSI_SR_BSY_S                                                         4

// Field:     [3] RFF
//
// Receive FIFO full:
//
// 0: Receive FIFO is not full.
// 1: Receive FIFO is full.
#define SSI_SR_RFF                                                  0x00000008
#define SSI_SR_RFF_BITN                                                      3
#define SSI_SR_RFF_M                                                0x00000008
#define SSI_SR_RFF_S                                                         3

// Field:     [2] RNE
//
// Receive FIFO not empty
//
// 0: Receive FIFO is empty.
// 1: Receive FIFO is not empty.
#define SSI_SR_RNE                                                  0x00000004
#define SSI_SR_RNE_BITN                                                      2
#define SSI_SR_RNE_M                                                0x00000004
#define SSI_SR_RNE_S                                                         2

// Field:     [1] TNF
//
// Transmit FIFO not full:
//
// 0: Transmit FIFO is full.
// 1: Transmit FIFO is not full.
#define SSI_SR_TNF                                                  0x00000002
#define SSI_SR_TNF_BITN                                                      1
#define SSI_SR_TNF_M                                                0x00000002
#define SSI_SR_TNF_S                                                         1

// Field:     [0] TFE
//
// Transmit FIFO empty:
//
// 0: Transmit FIFO is not empty.
// 1: Transmit FIFO is empty.
#define SSI_SR_TFE                                                  0x00000001
#define SSI_SR_TFE_BITN                                                      0
#define SSI_SR_TFE_M                                                0x00000001
#define SSI_SR_TFE_S                                                         0

//*****************************************************************************
//
// Register: SSI_O_CPSR
//
//*****************************************************************************
// Field:   [7:0] CPSDVSR
//
// Clock prescale divisor:
// This field specifies the division factor by which the input system clock to
// SSI must be internally divided before further use.
// The value programmed into this field must be an even non-zero number
// (2-254). The least significant bit of the programmed number is hard-coded to
// zero. If an odd number is written to this register, data read back from
// this register has the least significant bit as zero.
#define SSI_CPSR_CPSDVSR_W                                                   8
#define SSI_CPSR_CPSDVSR_M                                          0x000000FF
#define SSI_CPSR_CPSDVSR_S                                                   0

//*****************************************************************************
//
// Register: SSI_O_IMSC
//
//*****************************************************************************
// Field:     [3] TXIM
//
// Transmit FIFO interrupt mask:
// A read returns the current mask for transmit FIFO interrupt. On a write of
// 1, the mask for transmit FIFO interrupt is set which means the interrupt
// state will be reflected in MIS.TXMIS. A write of 0 clears the mask which
// means MIS.TXMIS will not reflect the interrupt.
#define SSI_IMSC_TXIM                                               0x00000008
#define SSI_IMSC_TXIM_BITN                                                   3
#define SSI_IMSC_TXIM_M                                             0x00000008
#define SSI_IMSC_TXIM_S                                                      3

// Field:     [2] RXIM
//
// Receive FIFO interrupt mask:
// A read returns the current mask for receive FIFO interrupt. On a write of 1,
// the mask for receive FIFO interrupt is set which means the interrupt state
// will be reflected in MIS.RXMIS. A write of 0 clears the mask which means
// MIS.RXMIS will not reflect the interrupt.
#define SSI_IMSC_RXIM                                               0x00000004
#define SSI_IMSC_RXIM_BITN                                                   2
#define SSI_IMSC_RXIM_M                                             0x00000004
#define SSI_IMSC_RXIM_S                                                      2

